UPS.Service/Web References/FreightShipService/FreightShip.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:fsp="http://www.ups.com/XMLSchema/XOLTWS/FreightShip/v1.0" xmlns:upss="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0" xmlns:tns="http://www.ups.com/WSDL/XOLTWS/FreightShip/v1.0" xmlns:error="http://www.ups.com/XMLSchema/XOLTWS/Error/v1.1" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.ups.com/WSDL/XOLTWS/FreightShip/v1.0" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema>
      <xsd:import schemaLocation="UPSSecurity.xsd" namespace="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0" />
      <xsd:import schemaLocation="Error1.1.xsd" namespace="http://www.ups.com/XMLSchema/XOLTWS/Error/v1.1" />
      <xsd:import schemaLocation="FreightShipWebServiceSchema.xsd" namespace="http://www.ups.com/XMLSchema/XOLTWS/FreightShip/v1.0" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="ShipRequestMessage">
    <wsdl:part name="Body" element="fsp:FreightShipRequest" />
    <wsdl:part name="UPSSecurity" element="upss:UPSSecurity" />
  </wsdl:message>
  <wsdl:message name="ShipResponseMessage">
    <wsdl:part name="Body" element="fsp:FreightShipResponse" />
  </wsdl:message>
  <wsdl:message name="ShipErrorMessage">
    <wsdl:part name="ShipError" element="error:Errors" />
  </wsdl:message>
  <wsdl:portType name="FreightShipPortType">
    <wsdl:operation name="ProcessShipment">
      <wsdl:input name="ShipRequest" message="tns:ShipRequestMessage" />
      <wsdl:output name="ShipResponse" message="tns:ShipResponseMessage" />
      <wsdl:fault name="ShipError" message="tns:ShipErrorMessage" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="FreightShipBinding" type="tns:FreightShipPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="ProcessShipment">
      <soap:operation soapAction="http://onlinetools.ups.com/webservices/FreightShipBinding/v1.0" style="document" />
      <wsdl:input name="ShipRequest">
        <soap:body use="literal" parts="Body" />
        <soap:header message="tns:ShipRequestMessage" part="UPSSecurity" use="literal">
          <soap:headerfault message="tns:ShipErrorMessage" part="ShipError" use="literal" />
        </soap:header>
      </wsdl:input>
      <wsdl:output name="ShipResponse">
        <soap:body use="literal" parts="Body" />
      </wsdl:output>
      <wsdl:fault name="ShipError">
        <soap:fault use="literal" name="ShipError" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="FreightShipService">
    <wsdl:port name="FreightShipPort" binding="tns:FreightShipBinding">
      <soap:address location="https://wwwcie.ups.com/webservices/FreightShip" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>