soapTestRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:error="http://www.ups.com/XMLSchema/XOLTWS/Error/v1.1" xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:upss="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0" xmlns:fsp="http://www.ups.com/XMLSchema/XOLTWS/FreightShip/v1.0" xmlns:tns="http://www.ups.com/WSDL/XOLTWS/FreightShip/v1.0">
    <soap:Header>
        <upss:UPSSecurity>
            <upss:UsernameToken>
                <upss:Username>eventrio</upss:Username>
                <upss:Password>Kenziemac1!</upss:Password>
            </upss:UsernameToken>
            <upss:ServiceAccessToken>
                <upss:AccessLicenseNumber>ECD9453AD9018E66</upss:AccessLicenseNumber>
            </upss:ServiceAccessToken>
        </upss:UPSSecurity>
    </soap:Header>
    <soap:Body>
        <fsp:FreightShipRequest xmlns:fsp="http://www.ups.com/XMLSchema/XOLTWS/FreightShip/v1.0" xmlns="http://www.ups.com/XMLSchema/XOLTWS/FreightShip/v1.0">
            <common:Request>
                <common:RequestOption>1</common:RequestOption>
            </common:Request>
            <fsp:Shipment>
                <fsp:ShipFrom>
                    <fsp:Name>Developer Test 1</fsp:Name>
                    <fsp:Address>
                        <fsp:AddressLine>101 Developer Way</fsp:AddressLine>
                        <fsp:City>Richmond</fsp:City>
                        <fsp:StateProvinceCode>VA</fsp:StateProvinceCode>
                        <fsp:Town></fsp:Town>
                        <fsp:PostalCode>23224</fsp:PostalCode>
                        <fsp:CountryCode>US</fsp:CountryCode>
                    </fsp:Address>
                    <fsp:Phone>
                        <fsp:Number>8326891199</fsp:Number>
                    </fsp:Phone>
                </fsp:ShipFrom>
                <fsp:ShipperNumber>E06F44</fsp:ShipperNumber>
                <fsp:ShipTo>
                    <fsp:Name>Consignee Test 1</fsp:Name>
                    <fsp:Address>
                        <fsp:AddressLine>1000 Consignee Street</fsp:AddressLine>
                        <fsp:City>Allanton</fsp:City>
                        <fsp:StateProvinceCode>MO</fsp:StateProvinceCode>
                        <fsp:Town></fsp:Town>
                        <fsp:PostalCode>63025</fsp:PostalCode>
                        <fsp:CountryCode>US</fsp:CountryCode>
                    </fsp:Address>
                    <fsp:AttentionName></fsp:AttentionName>
                    <fsp:TariffPoint></fsp:TariffPoint>
                </fsp:ShipTo>
                <fsp:PaymentInformation>
                    <fsp:Payer>
                        <fsp:Name>Developer Test 1</fsp:Name>
                        <fsp:Address>
                            <fsp:AddressLine>101 Developer Way</fsp:AddressLine>
                            <fsp:City>Richmond</fsp:City>
                            <fsp:StateProvinceCode>VA</fsp:StateProvinceCode>
                            <fsp:Town></fsp:Town>
                            <fsp:PostalCode>23224</fsp:PostalCode>
                            <fsp:CountryCode>US</fsp:CountryCode>
                        </fsp:Address>
                        <fsp:ShipperNumber>E06F44</fsp:ShipperNumber>
                        <fsp:AttentionName></fsp:AttentionName>
                    </fsp:Payer>
                    <fsp:ShipmentBillingOption>
                        <fsp:Code>10</fsp:Code>
                        <fsp:Description>Pre-Paid</fsp:Description>
                    </fsp:ShipmentBillingOption>
                </fsp:PaymentInformation>
                <fsp:Service>
                    <fsp:Code>308</fsp:Code>
                    <fsp:Description>UPS Freight LTL</fsp:Description>
                </fsp:Service>
                <fsp:HandlingUnitOne>
                    <fsp:Quantity>1</fsp:Quantity>
                    <fsp:Type>
                        <fsp:Code>PLT</fsp:Code>
                        <fsp:Description>Pallet</fsp:Description>
                    </fsp:Type>
                </fsp:HandlingUnitOne>
                <fsp:Commodity>
                    <fsp:CommodityID></fsp:CommodityID>
                    <fsp:Description>Samples</fsp:Description>
                    <fsp:Weight>
                        <fsp:UnitOfMeasurement>
                            <fsp:Code>LBS</fsp:Code>
                            <fsp:Description>Pounds</fsp:Description>
                        </fsp:UnitOfMeasurement>
                        <fsp:Value>1500</fsp:Value>
                    </fsp:Weight>
                    <fsp:NumberOfPieces>1</fsp:NumberOfPieces>
                    <fsp:PackagingType>
                        <fsp:Code>PLT</fsp:Code>
                        <fsp:Description>Pallet</fsp:Description>
                    </fsp:PackagingType>
                    <fsp:FreightClass>92.5</fsp:FreightClass>
                    <fsp:NMFCCommodityCode>1160301</fsp:NMFCCommodityCode>
                </fsp:Commodity>
            </fsp:Shipment>
        </fsp:FreightShipRequest>
    </soap:Body>
</soap:Envelope>